{
    "years": [
        {
            "year": "861",
            "months": [
                {
                    "month": "Teragoth",
                    "entries": [
                        {
                            "header": {
                                "path": "./entries/861/Teragoth/",
                                "fileName": "01-10-861-Taramont.md",
                                "date": {
                                    "formatedString": "01-10-861",
                                    "dayAsString": "01st",
                                    "day": "01",
                                    "month": "Teragoth",
                                    "yearAsString": "861st year, Age of Air",
                                    "year": "861"
                                },
                                "location": "Taramont"
                            },
                            "data": "# 1st of Teragoth 861st Year Age of Air, Taramont\n\nYesterday was really hard day. Getting accosted by some pemu loudmouth who was convinced his party was better than us. I do not know why others entertained his pem idea of contest. I saw his like in troupe, both members and customers, always boasting about how good they are, always with something to prove. Pathetic. Best way to deal with their like is to ignore them, make them stew in their ridiculous need for recognition.\n\nHowever, Uthal did himself proud, beating their orc in pem contest of strength, it did not surprise me when they went to pub together afterwards. It was painfully obvious that thy had more in common with each other than just being their group muscle.\n\nI was little surprised when Babcha entertained fool need for recognition by engaging in some silly magic show. I do not know why I stayed as long as I did. At least Uthal was not too hard to find. Same cannot be said for teaching his new drinking friend how to play dice however. I have had more luck getting stones to float.\n\nAt least it was good fun and, unlike his self proclaimed leader, he proved nice enough person. I would have liked to have seen just how drunk he would have got if we carried on playing. Oh well, Uthal proved to be good company and willing to play. He was even willing to play for coin. But, before we could start to roll, that little shit came back in something of mood. From what I can gather fool was arrogant enough to challenge Babcha to dule. And now everyone has seen him for child he is. I hope that sufficiently tarnishes his reputation.\n\nBut, alas, we had little time to revel in his humiliation as it became apparent that there was something going on at fair. And, it turned out, that something was Uthal new friend who, in his drunkenness, had grabbed onto wheel and fallen off. Fortunately he lived, I would have felt rather bad if he had not as I was one who was, somewhat, responsible for his intoxicated state.\n\nWhat was less fortunate, or at least that is how it felt at time, was where we then found ourselves. Across way where collection of tents, outside which was ma and pa. They were about to perform song, listening to them reminded me of when I was child. When they had finished – this hurts to write, I am feeling emotional now just writing this – I went up to them. Over last month or so I have been trapped in dungeon; escaped from wizard; had one of my company try and kill me; fought bandits, dragons, vampires; been kidnapped, interrogated and tortured by witch who then tried to kill me; fought spiders, nearly saw Babcha die; been looked down on, mocked and derided; been put on trial. None of it, none, was as hard as what I did then. To face my parents, after 15 years, after failing them so gravely, was bravest thing I have ever done. But, by Lliira, I am glad I had courage. I am glad Babcha told me I should. Seeing them was best thing that has happened to me in years, since that day. Unsurprisingly ma did ask where Mały was. I could not lie to her, however much truth hurt I would not lie. So now they know. They did not take it well, but I do not blame them. Milil knows I did not. I cannot blame ma for asking for some time, I would have if position was other way. So I took my leave and was going to go back to Final Toll. I wish Babcha had offered to come back with me, and I wish Uthal loudmouth friend had stayed away, but they all decided to go to circus as planned. I would have, but I just did not have heart after what had just happened, I think others understood. But fate smiled on me, if only briefly, as Bruno saw me and said hello. It was good to see child and he lifted my soul. His parents called him away as they were planning on going to circus. But, before I could make my way back for what then would have been much more pleasurable evening than I was expecting moment ago, I saw Viconius making for circus. Not knowing what he might try to do to my fellows I followed hopping to warn them. Babcha response made me wonder why I had bothered, but with hindsight I think it was good I returned.\n\nBecause, when Viconius interned ring to begin his performance, I got shock of my life. Out of nowhere, looking like hell, Perrin appeared from nowhere. But this was not my Mały, my Mały would not have attacked Nana. After trapping Viconius in lamp – good riddance I say – Mały vanished into this strange orb. Babcha then also disappeared into it and I followed her. I then found myself in this silent world of shadows with this strange light like rope leading off into distance. With nothing else to do I followed it. Eventually it led to this glowing ball and everyone else appeared. I could not hear anything although I could see others talking. We then all went through thing and appeared at Marblerock pish. On far bank was Mały. He told us he wanted revenge on Viconius and what had happened to him, I cannot really remember it. My head would have been spinning at best of times, but that place, realm or whatever/wherever we were was weird. Whatever happened we left Mały and found ourselves back in circus.\n\nAfter I have no idea how long Uthal picked me up and I think everyone started back towards Final Toll. I must have fallen asleep at some point and I guess they must have taken me back there as I was woken in early hours by Babcha bursting into my quarters saying there was fire in town. I went to wake Nettle as Uthal struggled to get his armour on.\n\nWhen I got to fire Babcha was already there and helping to put fire out and I started to help as well. When Uthal arrived he charged into shop, with Nettle following, and they came out shortly with young female. They claimed that they had found bodies in cellar chained up. Owner of store was named as Rufus Telpin and he was soon found trying to leave city. He should have saved his breath grockel, his pathetic pleas were not enough to get Babcha mercy. Rightly so.\n\nWith fire dealt with and its victim being cared for we left that filth with guards and returned to Final Toll for what remained of night.\n\nWhen I woke I went to bar to steel myself for my trip to see my parents. For some reason Nettle stayed with me, she confuses me. As I was about to leave Tata entered. We then went to my quarters where we had wonderful talk. It was lovely to be with him again. And Nana is ok.\n\nNow, I look forward to sharing meal with my ma and pa. Same cannot be said for this council meeting.\n\nAt least I have that meal to look forward to, I am sure it will get me through.\n\n...\n\nThey say I am money grabbing coin whore. 2g for 20 arrows at pemu shop, and Nettle charged me twice that! Coin whore indeed, but at least it means I will not suffer that pemee again. At least, hopefully.\n\nI am glad halfling girl is ok, or as ok as you can be after being dragged out burning building. I hope she gets better, those at Temple of Helm had better look after her.\n\nMilil, I was not looking forward to that council meeting, but it turned out ok in end. After long discussion it seems that progress will actually be made with refugees outside. Council agreed to provide them with food and water, while things could be put in place to disperse them across cities and give them citizenship. I understand their concerns that there are imperial spies among refugees, but it should not be too hard to find them jobs where they cannot find any useful information and, once they have identified spies, they can even feed them false information.\n\nFools did not see it prudent to look into vampire issue though, pemay, pem groackelay. At least it meant we got to see who is sensible and who is callus grockel.\n\nOn plus side, when we spoke of Viconius Babcha revealed his true nature and he was subsequently stripped of his position on council. That is how you do it Mały, revenge hurts more if you are alive.\n\nThere seemed to be great deal of fear around empire and there was word that orcs are going on raids. But I am not sure how reliable Quentis source is, considering after giving their information they slipped into coma. And that says nothing of how much I trust Quentis. Regardless, we have been tasked with going to Waldon Heights to investigate these raids.\n\nInterestingly, that dirtbag Butterbur came up at council. Xaon had been keeping eye on Rusty Dragon when he noticed halfling get note from Butterbur using password \"Black Rose\". Now we are also tasked with going to Rusty Dragon and finding this halfling and finding out what they know. I look forward to that task.\n\nBy Yaga were these people petty and pathetic though. Each out for their own interest and unable to see common good. That pemu goliath admiral, refusing to help refugees, because some might be spies. And then, when I give her an opportunity to identify spies she mocks me. I see no reason to help her. But, pish, worst was Sardar Karmi. That greedy grockelu, he has no interest in anything but making himself richer. I doubt he will get any help from us. I suspect that writ will not find its way to Waldon Heights. Even if Remi had not asked us to go there and see what dirt we could find linking Karmi to major, I am not sure we would have helped. While I have no interest in involving myself in Remi power struggle, hurting Karmi dose sound like worthwhile endeavour.\n\nI am saddened to hear of Thorbir troubles. I hope we can reach him in time to save him from whatever trouble he has gotten himself in. We lost Lyra and Fang, I do not want to lose anyone else. But first, there is small matter of that halfling at Rusty Dragon to deal with, and my promise to Butterbur.\n\n...\n\nAfter council we discussed our intentions for following morning and I then took my leave. On way to find my parents I passed ferris wheel and you could still see where Uthal orc friend had landed. I reckon that will make story or tow, maybe even song.\n\nWhen I got to site where all performers tents where I asked someone if he knew where Thorngages where and if he could show me. He did, fortunately, and when I arrived at my ma and pa tent Nana was sat up. Soon we had agreed to go out for dinner and I led them to Delosar. I am so happy that Nana is recovered.\n\nAt Delosar he claimed that there had been complaints regarding his food, I wonder why. Pem ooze. All is well and for better though I guess, as he bought this strange thing that made dinner for us. It seemed reasonably priced too, 5G/5 for three meals and three drinks. If we come back to Taramont I might recommend this place.\n\nWhile conversation was little awkward at start, Yaga I did not know what to say, it started to flow eventually, especially after we had finished eating. It was so nice to be with them both, I had not realised how much I had missed them. And was it nice to play tongo without having to explain game.\n\nIt was sad they had to go as early as they did, but it might be for best. I am sure good night rest will be helpful. Not to mention it meant I got back at same time as Nettle. Something makes me suspect Babcha visit to Arbiter did not go as planned.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/861/Teragoth/",
                                "fileName": "02-10-861-Taramont.md",
                                "date": {
                                    "formatedString": "02-10-861",
                                    "dayAsString": "02nd",
                                    "day": "02",
                                    "month": "Teragoth",
                                    "yearAsString": "861st year, Age of Air",
                                    "year": "861"
                                },
                                "location": "Taramont"
                            },
                            "data": "# 2nd of Teragoth 861st Year Age of Air, Taramont\n\nI was woken by loud crash this morning. But when I got to Uthal room, where it had come from, all I found was fool under his bed. Yep, definitely did not go to plan. Oh, listening to Babcha now. No, things did not go to plan. Uthal was meant to get some herbs and ended up in fight with eight people somehow. Sounds like last night would have been fun to watch.\n\nNow to sort out Butterbur issue.\n\nWell that did not go as expected. I was hoping this halfling would be in bar so I could go up and talk to him. But I needed drink if I was to sit in bar and wait, I could not say anything because Butterbur would recognise my voice. Yaga, I did not realise how rude he was when I first met him. Grockel. Anyway, he asked his guard to escort me out, but not before I had tried to signal to Uthal to get others. Whatever, by time I was halfway to exit I had had enough of playing and took off my hat. Now pem guard started dragging me to back to be put with \"the others\", whatever that means. I think someone should find out. Then Babcha appeared and, I am guessing, started playing with fire as it changed colour. Not that it did much or stopped me getting dragged down side corridor.\n\nBut there things changed as suddenly Butterbur fell asleep. Tired of this pem dragging me around I tried to stab him but he deflected my blow then he swung at me with his sword. But before either of us could do anything else he let go, I guess it must have been Babcha doing as she then told me to run before doing so herself. I also took my leave, but not without keeping my promise to Butterbur on way. Once I got my knife free I made for exit, but when I rounded corner into corridor it seems guard came free of whatever Babcha had done to him as he started chasing me. In bar I saw red haired halfling lying on floor, I guess that must have been Uthal work as he got note, or maybe Nettle. not sure where she was in all this. Doing something useful I hope. But all is well as we all got out. Apparently I am no longer welcome there.\n\nWhen Uthal showed me note it was little hard to read but it mentioned meeting up in Maytarn Mountains. And I think we have 36 hours to get there. I am not sure how we are going to do all this. We have still got Thorbir to save.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/861/Teragoth/",
                                "fileName": "02-10-861-Mountains.md",
                                "date": {
                                    "formatedString": "02-10-861",
                                    "dayAsString": "02nd",
                                    "day": "02",
                                    "month": "Teragoth",
                                    "yearAsString": "861st year, Age of Air",
                                    "year": "861"
                                },
                                "location": "Mountains"
                            },
                            "data": "# 2nd of Teragoth 861st Year Age of Air, Mountains\n\nIt took us fair to long to decide what to do this morning. I read note out for them and I said we had about 36 hours before this meeting so clearly time was of essence, but they went round and round in conversation about what to do. Finally we decided that we should ask king for use if his airship and Uthal wanted to talk to high druid. So we split up, Uthal and Babcha went to druid while I went to king with Nettle. I did not look forward to that meeting.\n\nWhen we met him he refused to let us use airship, saying he had not given us right to use it, but would grant right if we proved ourselves. Pem grockel, it is not like we were wanting to go gang jolly. We wanted it to do task he had set us. Fortunately someone there decided it worthwhile to offer us aid and said we could use teleportation chamber in Circle of Mages tower.\n\nWe also got some interesting news from Seeker Xaon. Apparently halfling from Rusty Dragon may have been member of some group and was working with Xaon. Nettle said she had not met him, so assuming she was not lying, other two might be having to explain themselves.\n\nAnyway, we set off to tower and Babcha strange talking bird came down to squawk at me about how others had found way to Briar Pass. We stayed with our original means as Babcha said she would meet us there.\n\nAfter some time waiting around in tower for what Babcha called \"bureaucracy\" we were finally allowed to go. We put our hands on this thing in the middle of room and next thing I knew we were somewhere else. I do not like this strange stuff. Never thought I would say this, but u prefer boat.\n\nWhen we went to leave this new keep place couple of upstarts decided to quiz us, one just wanted to know who we were and what we were doing, other was rather threatening and aggressive. If Nettle does not talk to others about him I think I should. Whatever, we were allowed to leave and set off down path looking for stone described in note. We found Babcha and Uthal waiting couple of miles down road and continued with them.\n\nWhen we found stone we turned east off path as directions on note said. After while we came to what seemed like dead end, but more significant than that was all the pools of green around and strange statues or, at least, they looked like statues. More significant that that was strange metal beast that came out of cave. Yaga, I wanted to stay away from it. But, thankfully, we felled it fairly quickly. Uthal, pemu, decided to get all up close and personal before transforming into bear. Nettle also got bit close, but soon backed away. While Uthal wrestled with beast, and Babcha did I do not know what, I kept my distance and loosed at it with my crossbow. Not that it seemed to do much at first, but my third bolt seemed to reveal weakness in its armour. Or hide. Or whatever. Then Babcha came into fight in spectacular fashion, sending one blast at beast which seemed to finish it off even though it had enough left in it to at least start running at Nettle before exploding.\n\nIf you are only going to make one contribution to fight, I guess it is good to make it count. After beast fell I retrieved the one bolt that survived before taking careful look at that note, I wanted to make sure we were going right way. Which it seemed we were.\n\nAs such we continued until we decided it was time to make camp and found sheltered little alcove and made fire. After having some of Uthal berries and tea he made from them Babcha decided she would take first watch and left us. Uthal went to talk to Nettle, it was interesting listening to her talk about her background. And that floating sword of her's is strange.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/861/Teragoth/",
                                "fileName": "03-10-861-Mountains.md",
                                "date": {
                                    "formatedString": "03-10-861",
                                    "dayAsString": "03rd",
                                    "day": "03",
                                    "month": "Teragoth",
                                    "yearAsString": "861st year, Age of Air",
                                    "year": "861"
                                },
                                "location": "Mountains"
                            },
                            "data": "# 3rd of Teragoth 861st Year Age of Air, Mountains\n\nBabcha woke us up last night while it was still dark. Soon it became apparent why as pack of wolves appeared at top of ridge behind our camp. Babcha tried to reason with what I assume was leader but he ignored us and told pack to attack us. Fortunately, for some reason lot of them just came up and kind of wandered around. It was some fight, there was this massive white wolf that spewed horrible cold force at us. I kind of lost track of what happened, it was somewhat chaotic, but I loosed bolt at leader before I got attacked by another wolf. I spent rest of fight engaged with it and eventually felled it, poor thing. I wish it did not have to be. When fight was over all the wolves ran away bar two, great big white one and what turned out to be Uthal.\n\n...\n\nAfter waking we continued east in search of this rendezvous. After while we found tower that note described as next waypoint and turned north. I wonder if we will regret not looking into the source of that smoke. Soon Babcha noticed some footprints, obviously from some small humanoid. As it might have been our halfling friend from Rusty Dragon I told others what Xaon had told us when we went to king. I do not think Babcha was best pleased. As such we continued north post haste. And did not we then get sight. On path was this giant bird thing with injured wing. Uthal and Babcha started approaching it carefully and threw some food down for it. Soon it left, I hope it is ok, and we headed north.\n\nAs it was starting to get dark we saw light from fire on top of ridge. We approached as quietly as we could, which was not easy as I could barely see anything. I heard some people calling out to each other and it seems like those footprints might have been gnome, who promptly got himself tied up.\n\nEventually inevitable happened and combat began. Uthal turned himself into giant spider, which brought back unwelcome memories, but at least he tried to tell me and when he picked me up and carried me on his back it made for easy way up hill. Nettle ran off by herself and I had no idea where Babcha was at this point. Turns out there was someone from empire who had this metal beast under his control. I loosed bolt at man but then beast attacked me. But with my help, Babcha and her wolf, which had been following us for some strange reason, managed to weaken beast, as did Uthal who landed killing blow with javelin. Then, with everyone around him, man surrendered.\n\nBabcha then hurried off and when I caught up with her she was with another man, who I soon recognised as grokkel who tried to kill me and stole my things first night at Final Toll. And Babcha made him give it all back. We then returned with this other prisoner, who was acting very strangely, to Uthal and Nettle and searched camp.\n\nThen we were accosted by halfling from Rusty Dragon, who was most upset that we had ruined his grand plans to infiltrate Black Roses. Yaga, what care I? we all then started trying to agree on who should get what. Seems little unfair to me that he should prosper from fruits of our labour.\n\n...\n\nSo, our little prisoner gave us bit of information while I made sure gnome was ok. We then had look at puzzle box man had been carrying. Me and Uthsl eventually got it open and when we did Babcha wanted to be one who read documents inside, as if she had done something. We also let halfling look at them, though I still do not know why he gets to benefit. We are ones who shed blood to get them. Still, at least when he took his leave he killed grokkel so I do not have to worry about him coming for his things this time. Although I thought he wanted to question him. Pemu. Also makes me wonder why he asked me to move him if was always going to just kill him. I wonder if he was just trying to impress us, he was trying to talk big then.\n\nBut, Yaga, I am so cold. I wish Ailuin had not done whatever magic she did when she arrived. I did not like it how snow just started swirling round me, all this is so strange. But when this spell, or whatever, stopped all that snow, which had melted, fell on me. Pish. And now I am so cold, all I can say is thank Yaga for this fire.\n\nAll that being said, it was good to see Ailuin. I know she means a lot to Babcha and I think she was worried when we could not find her in Taramont last. It was less good to see the state of her, she looks like she got beat up.\n\nAnd that bird thing she road in on, looks the same as whatever we met on way here just passed tower. I hope it is ok.\n\nYaga, I am still cold, but this fire is starting to help.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/861/Teragoth/",
                                "fileName": "04-10-861-Mountains.md",
                                "date": {
                                    "formatedString": "04-10-861",
                                    "dayAsString": "04th",
                                    "day": "04",
                                    "month": "Teragoth",
                                    "yearAsString": "861st year, Age of Air",
                                    "year": "861"
                                },
                                "location": "Mountains"
                            },
                            "data": "# 4th of Teragoth 861st Year Age of Air, Mountains\n\nYaga, would people stop turning into animals. Got attacked by mob of orc bandits last night. What won the fight? Was it Uthal turning into bear? No. Was it Uthal turning into wolf? No, although he did. It was when this great big dragon came down and scared away orcs. Who was this dragon? Azshara. Everyone is turning into animals and I do not like it. I want it to stop.\n\nAlthough, I should be grateful. I could not see any of them lurking in dark when they first called out, and then Babcha made me stop glowing and stopped fire, so I could not see anything, at least until Nettle lit torch. I made my way up cliff face at back of camp opposite of where sounds came from. Fortunately no one was there. I then readied my crossbow and waited. I did not have to wait long as soon hordes of orcs swamped into camp. I loosed bolt at first one as it headed to Babcha, and what shot, I found my mark and felled brute. Unfortunately, I could not stop any others as they surrounded my friends. I saw Babcha fall, and even though Ailuin joined fight it looked lost. I saw Nettle run, I do not think I have ever seen her flee fight. Uthal did not, which does not surprise me. I do not think he knows how to leave fight.\n\nBut then, as I and Nettle where fleeing and sounds of battle betrayed what was happening behind us, giant dragon appeared and next thing I knew was orc giving order to flee. I made my way back to camp and saw Ailuin talking to dragon as if she knew it. Then dragon turned into Azshara.\n\nYaga, what is going on?\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/861/Teragoth/",
                                "fileName": "04-10-861-Taramont.md",
                                "date": {
                                    "formatedString": "04-10-861",
                                    "dayAsString": "04th",
                                    "day": "04",
                                    "month": "Teragoth",
                                    "yearAsString": "861st year, Age of Air",
                                    "year": "861"
                                },
                                "location": "Taramont"
                            },
                            "data": "# 4th of Teragoth 861st Year Age of Air, Taramont\n\nPemu gnome, I wish he had stayed out of all of this, for all our sakes. Overhearing us talking to Ailuin in tower, yaga, what was he doing listening to us? Now we have to trust him to hold his tongue? I would be more comfortable if he was with someone I trusted, as apparently keeping him somewhere he cannot blather is wrong simply because only example I could think of was dungeon. Pish. It is shame Tata and Nana have gone, I would have felt better if this fool had been left in their care. Not to mention it would have been nice to see them once more, I have missed them over years.\n\nAt least we no longer have to worry about prisoner we took in mountains. And I look forward to getting my new armour when we next return to this damn town. Even if it was expensive. It feels strange to spend so lavishly after all these long years, 200g. I would never have thought of spending that much year ago on glorified clothing.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/861/Teragoth/",
                                "fileName": "06-10-861-Mountains.md",
                                "date": {
                                    "formatedString": "06-10-861",
                                    "dayAsString": "06th",
                                    "day": "06",
                                    "month": "Teragoth",
                                    "yearAsString": "861st year, Age of Air",
                                    "year": "861"
                                },
                                "location": "Mountains"
                            },
                            "data": "# 6th of Teragoth 861st Year Age of Air, Mountains\n\nOn approach to Walden Heights we came across these giants. Or something, to be honest I am not sure what they were but they made hideous noise. We tried to sneak past them, but after climbing cliff face as she tried to flank them Babcha fell and seemed to attract their attention. Fortunately she was quick enough to disappear somewhere before they saw her and I managed to get Uthal to throw stone in opposite direction to try and distract them. I think it worked. Then I saw Babcha at top of cliff, she was waving at us like reed in wind trying to get us to follow her. I quickly made my way to base and climbed rope she had lowered and Nettle followed. Uthal, pemee, then went up to things and seemed to start talking to them. I have little idea what happened but they seemed provoked to anger. At that point I feared worst, but rather than attacking Uthal as I had feared they started fighting amongst themselves. Babcha then loosed her bow and I followed with my crossbow. Soon three things were on floor and we could safely continue. No thanks to Nettle.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/861/Teragoth/",
                                "fileName": "07-10-861-Walden Heights.md",
                                "date": {
                                    "formatedString": "07-10-861",
                                    "dayAsString": "07th",
                                    "day": "07",
                                    "month": "Teragoth",
                                    "yearAsString": "861st year, Age of Air",
                                    "year": "861"
                                },
                                "location": "Walden Heights"
                            },
                            "data": "# 7th of Teragoth 861st Year Age of Air, Walden Heights\n\nI hate orcs, savages. We arrived at Walden Heights to sight of normal town, or so it looked. Red Dragon I saw on wing soon changed my perspective and it was not long before we could make out green skins in town. We hastened to town only to find mob of barbaric creatures attacking woman and man and their children. We all rushed in to try and save them but in spite of our best efforts we could not save mother. Thank yaga Nettle actually did something this time. And I think it good thing all those scum lay dead when we were done.\n\nWe then fled to keep with yet more orcs chasing us. I am glad we are all safe now, but yaga, Babcha cut it close. To close for my comfort.\n\n"
                        }
                    ]
                }
            ]
        },
        {
            "year": "862",
            "months": [
                {
                    "month": "Obeli",
                    "entries": [
                        {
                            "header": {
                                "path": "./entries/862/Obeli/",
                                "fileName": "15-01-862-Thandrium.md",
                                "date": {
                                    "formatedString": "15-01-862",
                                    "dayAsString": "15th",
                                    "day": "15",
                                    "month": "Obeli",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Thandrium"
                            },
                            "data": "# 15th of Obeli 862nd Year Age of Air, Thandrium\n\nYaga, it was so good to see Babcha and Vujek after all these months. They've changed. Babcha is now a werewolf and Vujek has lost his arm. But what care i? it's just to good to see them.\n\nBut curse that pem dragon. I would have enjoyed our reunion more had it not been for beast. Alas there was no time for hellos at first, me and Mały had to worry about stopping it from killing Vujek first. Yaga, he looked in a bad way. Praise Lliira for Ailuin, for she used magic and Vujek got off floor. It was some fight that took place. I hit beast with stone from my sling and used my magic on it, Yaga I'm still getting used to this, Mały struck it with his wip while Babcha, Durzol and Vujek attacvked it in melee.\n\nEventually beast was felled, good ridence, and we had chance to make greetings. But it was soon back to task in hand, not that I had much idea what it was at time. We went to find Thorbir, praise Lliira, and learnt his father had died and concluded that Dawn Star had been taken. This was not happy reunion,I feel sorry for Thorbir. I know what it is too loose family.\n\nBut alas, again we had little time and went in search of Dawn Star. I felt little lost. I know not what has happened to my friends or about this place. Something to do with Empire is afoot and I fear trouble is in reeds.\n\nI fear we must now take time to talk and plan. I want to know what that thing was in air that left wherever we are. And what happened to Vujek.\n\n...\n\nI wonder who that man was. He seemed to know others and gave them all something, he even gave me something, even if it was just silly stone. Why do I want stone? Once he'd said his farewells he departed with empire men. Guess I won't get to know him. But, Yaga, Azshara was rude. As soon as he' he'd gone she was talking about how everything he'd said had been boring, I thought it was rather touching, I mean it seemed to touch Nettle and she's cold. And boring indeed, all Azshara wanted to talk about was that boring political stuff. But I guess it was necessary, we do need to decide what to do. I just wish it didn't take so long.\n\nWhatever, we found way to get to Taramount, or at least part of way with help of dwarves. I hope Thorbir is ok and manages after we leave.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Obeli/",
                                "fileName": "18-01-862-Taramount.md",
                                "date": {
                                    "formatedString": "18-01-862",
                                    "dayAsString": "18th",
                                    "day": "18",
                                    "month": "Obeli",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Taramount"
                            },
                            "data": "# 18th of Obeli 862nd Year Age of Air, Taramount\n\nIt was actually nice to see city again, I guess I must have become familiar with it and comfortable. Feels strange after so many years of just passing through, always moving and never looking back. But, Yaga, it wasn't nice to see that airship.\n\nWent to see council to tell them what we'd learnt. I would have rathered getting something to eat and finding somewhere to stay, but Durzal went to do that. When we got council meeting we found Isophie and she told us there was meeting planned at sunset, so did have time for food. But real event happened when that gnome and that strange deer thing appeared. She really did make me uncomfortable, how she was talking about me and Mały. And I thought she was crazy, talking to \"Fidget\", but there was that point I saw what looked like rabbit for second. Maybe she isn't crazy and that's what she's talking about.\n\nWhatever, she's unnerving and I wish she'd leave me alone, I'm no project, or whatever she said. At least she was willing to play tongo. And I didn't like hearing that pish airship had actually attacked city, and Yaga did it leave big crater from whatever it had loosed. I don't like this. Urdlen, gnome, used some magic spell and found that there where traces of what of what he called \"raw potential\", and from how he explained what it was I can't help but think it's very bad news.\n\nAt council meeting Urdlen and Eary were allowed in, which I thought was bit presumptions on our part as we didn't even ask. Thinking about it, that's good way to describe Eary, she doesn't seem to know much about everyday world. Their ambassador from empire came in with box, saying their was message inside. Urdlen said it was using illusionary magic. How everyone seems to be magic is kind of making me feel better about what's happened to me. Babcha is magic, so is Vujek and Ailuin, Mały, Azeshara and now Urdlen and Eary also seem to be magic. Magic used to freak me out and when I came back and learnt I was magic it made me uncomfortable, but knowing so many others are too kind of makes me feel normal. While, sort of.\n\nAnyway, illusion turned out to be Xaon's head, and it started talking, saying if we didn't surrender city they'd destroy it and we had day. I don't like pem ambassador. Pem fat grokkel, all show and pompous. After seeing this Isophie took her leave and reast of us started talking. Kami straight away called for surrender and started waxing about how king wasn't here and had let us down. I'm sure he's for empire, grokkel. Fortunately everyone was quick to shoot him down and it didn't take long before it was decided we should sleep on what we've heard and reconvene later, so we headed to Final Toll, where Durzol had already gone to find rooms. We had couple of drinks and I played tongo with Mały and Eary before making sleep. Tomorrow will be interesting day.\n\nWhile I thought I'd get to sleep. But before I went up to my room Isophie came into Final Toll. Babcha was quite strange around her, I think she thought it might be trick. Anyway, Isophie apologised for her behaviour at council and told us that Cancak had arrived. Babcha suggested that he shouldn't go before council because there was untrustworthy people in it. She been blathering about it and what we should do all night. Anyway, Isophie took us to Delosar's where Cancak was staying. Silly Babcha, she went to kick door down because of blue light she could see, but she only brock panel in door and it wasn't locked anyway. Not to mention Cancak just invited us in and blue light was just something he was drinking. After very lengthy discussion he'd told told us what discovered in Empire and everyone agreed that he wouldn't go to council but would find sanctuary in our base, along with his family, with assurances we'd keep him safe. I still don't completely trust him though, he sounded very willing to turn on us if he was caught by empire.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Obeli/",
                                "fileName": "19-01-862-Thandrium.md",
                                "date": {
                                    "formatedString": "19-01-862",
                                    "dayAsString": "19th",
                                    "day": "19",
                                    "month": "Obeli",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Thandrium"
                            },
                            "data": "# 19th of Obeli 862nd Year Age of Air, Thandrium\n\nThis morning we agreed on what we'd do. I still think I should go to Eilnala and try to make allies of shadow thieves, but Babcha was very against it. I think she has trust issues, but, if I'm honesty, I may not be one to talk. We agreed what misinformation we'd tell Mateki and Remi, but we only managed to talk to Mateki before council.\n\nBefore we even went there however we went to see Gertrude and Kurbor. Gertrude's shop seemed very run down, it seems Sardar is doing lot to run him down, grokkel. We still managed to buy some things though and that deer thing, Eary, showed up. At Kurbor's we got Babcha's sword and Nettle's shield, but I was dismayed at how he was acting, he seemed delighted at about current situation because it was good for business, pem. Gertrude seemed wiser, he joined our cause, even if he did leave it to chance.\n\nBut, Yaga, event of day was at council meeting. That grokkel empire women was there, she is such showman, so arrogant. I can't stand people like her. She delivered her terms and left us to decide what to do, but only when she seemed to find our behaviour to antagonistic and plodded out. Frumpy grokkel. I did find it funny how annoyed she got because Babcha wouldn't sit down and I sat on table, shame Nettle didn't make stand. But when she jumped on table and went to kick me I got such shock, I was suddenly in different realm and there was bunny thing I thought I saw yesterday. I think Eary called it fidget. It slapped my hand and seemed happy at what had happened, so I guess it is with Eary and maybe Eary is all right. When I got over my shock though I found it so funny and could not stop grinning. Maybe this magic can be fun.\n\nAfter she left we spoke about what to do. Sardar, no surprise, just wanted to surrender. I do not trust him and can't help but think we'd all be better off if he was dead. Perhaps. Remi wanted to fight, and Mateki wanted to stall. Babcha wanted to kill leader and replace her with someone. After we all voted Isophie decided to adopt combination of Babcha's and Mateki's plans, which is what I thought was best.\n\nGuess we're off hunting now. I only hope these politicians do their job properly and Sardar doesn't compromise things. Still, perhaps.\n\nI'm also surprised Nettle voted to just stall. I would have thought she'd be more confrontational, after all, she was soldier.\n\nI also wonder if she'll train me to use shield. I can't help but think buckler would be useful now I don't have my crossbow. And I wonder what Urdlen and Eary will be like, it feels like they're going to be around awhile.\n\nI wish I could talk to Ma and Pa, they'd know what to do. And I wish Vujelk was here.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Obeli/",
                                "fileName": "20-01-862-Temple of Shar.md",
                                "date": {
                                    "formatedString": "20-01-862",
                                    "dayAsString": "20th",
                                    "day": "20",
                                    "month": "Obeli",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Temple of Shar"
                            },
                            "data": "# 20th of Obeli 862nd Year Age of Air, Temple of Shar\n\nWhat couple of days I've had, Yaga. So much went wrong, I had such good idea. I was going to rid us of that dirty grokkel Karmi, traitor that he is, but it all went so wrong. Pemi, used wrong spell so he knew what I'd done, maybe I need to think more about this new magic stuff until I'm used to it bit more. But, worse than that, I swear he must have had some magic protection. So I got thrown in cells, was miserable in there, with that drunk and creep who kept licking his lips. I think it was nervous twitch, I hope it was, but he didn't have to keep staring at me. But, Yaga, worst of all was guard, miserable grokkel. All I wanted was my cards so I had something to do, but would he let me have them? No. and what good did it do him? All entertainment I had left to me was talking and even Nettle would have offered better conversation than those three. So I spoke to best conversationalist there was in damn place, myself. It was funny how much it annoyed guard, but if he'd only let me have my cards this would have been avoided. I even explained as much to him, not that he understood, don't think he understood halfling.\n\nAnd all this after we'd spent so much time planning what we'd tell who in our attempt to find out who is crocked. Well, who in additions to Karmi. I hope I haven't messed that up. I'm also hoping it won't be necessary. Hopefully Remi will be true to her word and help us.\n\nCan't believe I got out of that mess by myself. Ironic that using magic got me into mess and using magic got me out. I feel little bad about those guards, especially one who got pulled out of carriage. I hope he survived. I kinf of hope other one is ok, even if he was bit of dick. I told him what was going on after spell, but he didn't listen. But I guess I would do lot for my family, and I hope he's ok, if only for his family's sake. It was funny when I got away though, he couldn't figure that one out. Wasn't even my best get away. Yaga, wasn't even my best escape from this town. Which now I'm out of, finally, praise Llirra. And I thought Taromount was starting to feel like home. Wrong there, I guess.\n\nI can't believe how awkward and unhelpful Nettle was. Ok, she's on wanted list, but she could have done something. I should be grateful to Mały, he was eager to help. Yaga, even Eary offered to help and she's calling me abomination. I don't understand Nettle, I wonder if I've done something to hurt her. Or if she at least perceives it as I have. Times like this I miss Vujek, he was always nice to me. I have Mały again, by LLirra I've missed him. Rascal wanted me to dress up in pem outfit Eary got.\n\nI'm so glad he's here now. This place brings back uncomfortable memories, Babcha nearly died here. Still, at least she made it out city, I was so worried about her, going rambling round city just so she can get coin out bank, when it's being attacked by dragons. This whole thing seems to be going from worse to worse.\n\nPraise be to LLirra we're out of that city. Hopefully we can actually do something now that'll actually have impact. Maybe it was good Vujek wasn't here. These last two days have been mess.\n\nAnd all this, of course, is saying nothing of what actually happened when me and Mały went to get my things back with Eary. Guards at barracks went all by book until Eary touched one, I'm pretty sure she used magic, I'm starting to get feel for it. Worked treat to, one she touched immediately started doing as she said. Another one really didn't like it, but what did that matter. We were allowed through, to Quentis' office no less. Shame it was locked, but then Mały really pulled out stops. I don't think. No I. What am I doing?! Llirra, forgive me. Mały, if you read this, I'll keep my promise.\n\nPish.\n\nOh! I forgot, at least I now know what strange stone that man gave me in Thandrium is now. It's some magic item that lets people talk to each other. I saw Nettle use it to tell Babcha about traps we found in tunnel. I even found I could hear Babcha through mine.\n\nYaga, my mind is all over place. I suppose it's not surprising after this morning, it's good to get my thoughts down.\n\nSpeaking of my mind being all over place, I didn't actually finish writing about what happened in barracks. Silly me. After Mały did his thing we got into office and all my stuff was there. Now, I'm not particularly worried about material goods, they come and go and can be replaced. But I was glad to get my stuff back, people did go out their way to help me and I'll be much more use with that stuff. And my cloths are far more comfortable than those itchy dungeon trash to boot. We then returned to Final Toll where we learned of tunnels and made good our escape.\n\nDon't care. If I've missed something, I've missed it. I'm actually going to finish this time and go to sleep.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Obeli/",
                                "fileName": "21-01-862-Temple of Shar.md",
                                "date": {
                                    "formatedString": "21-01-862",
                                    "dayAsString": "21st",
                                    "day": "21",
                                    "month": "Obeli",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Temple of Shar"
                            },
                            "data": "# 21st of Obeli 862nd Year Age of Air, Temple of Shar\n\nWell I thought I had finished writing, but things just happened that I have to write down. First I knew was when I was woken by Eary screaming. I know she's strange, but I couldn't imagine even her doing that when it was my watch, especially with Babcha there. When I got outside I could hear Babcha talking to these things that looked like giants we had met in mountains on way to Waldern Heights. Only they looked like they were dead. I mean, they literally looked like they were rotting. After I'd seen them I quietly made my way along hedge and readied my weapons in case we had to fight. I found gap at other end of hedge that meant I could see monsters while they talked to Babcha. I didn't really get it all, something about black rise.\n\nThen fighting started, I think it was Eary who initiated it. I slung bullet at one, but before I could do anything else whole hoard of zombies raised out ground and this wizard zombie came out building. He used magic to attack Babcha and all zombies seemed to attack, one certainly tried to attack me but to no avail. I didn't want to stay where I was, and made darkness so I could get away. I thought about going to help Nettle as there were several zombies attacking her, but she seems to be able to hold her own and Urdlen was there and I would probably cause him problems, he wouldn't be able to see. So I went to magic one. I managed to strike him several times and he looked close to defeat but he managed to fly away. When I looked back round there were bits of zombies everywhere, including all over Babcha who was werewolf. She'd been busy.\n\nBut few till stood, who were quickly slain. I think I'll need to talk to Babcha about what happened in morning, but right now I just want to dry off little and maybe get some more sleep.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Obeli/",
                                "fileName": "25-01-862-Immesvale.md",
                                "date": {
                                    "formatedString": "25-01-862",
                                    "dayAsString": "25th",
                                    "day": "25",
                                    "month": "Obeli",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Immesvale"
                            },
                            "data": "# 25th of Obeli 862nd Year Age of Air, Immesvale\n\nPem Fey. They are so weird and annoying, they have propensity to ruin everything. Giving me Fey Leaf while I was unconscious and making fool of me. just wait until he's where I can teach him lesson, then we'll see who can handle what.\n\nBut it is nice to be back here, where I've been greeted with open arms and as friend, even hosted by major who was good enough to give us meal. Yes, praise Llirra, it is good to be here, even with chaos caused by those dman Fey.\n\nAnd Bruno, while I'm glad he's ok, I'm so annoyed at him for how he behaved at Drunken Duck. And what is going on with his magic, I feel like there may be cause for concern. Granted, I know little about topic even though I have felt my power grow since leaving Taromont, whatever is going on clearly worried Urdlen. I hope boy isn't in any danger, he is dear to me.\n\nBut Yaga, that Drunken Duck was no pub. All I wanted was to go have quite drink with my friends and companions, and talk at nice pub. But what did we find, some Fey circus full of terrors causing chaos and mischief. Pish. Why where they here? Couldn't they have gone and annoyed some other village? And couldn't someone else have taken over Brass Salmon? That was good inn. And Monty was good man, or at least he was to me. he treated me so well and was always kind, I'm sad to hear he died. I can't believe he'd help hag. But if he did, then I guess Babcha was right. Damn hags, I hate them. I wish I'd been there to kill them myself, after what that one did to me. although, I guess she was right when she said Mały was alive. But I didn't know that at time, and even if I did trying to cook me wasn't good way to get me to betray my brother. Thinking about this, I should probably talk to Mały and Babcha about that tomorrow.\n\nAs for now, I guess we'll be looking at hideout. Durzol seemed keen to show us what he'd done. I hope there is place to pray there. If there isn't I'll have to make sure we build one. Obviously I'd just want shine to Llirra, blessed be her name, but I think Babcha worships another God and would probably want shine as well. So I guess best thing would be to just have general shine where people can pray to whatever they want. And while I'm talking about things to do in hideout, I think Mały said he wanted to make bar. While, now Monty is gone and no one is using Brass Salmon, maybe it would be good idea. It would provide alternative to pem Drunken Duck for everyone who wants to drink without chaos of that place. I guess we have lot to talk about tomorrow.\n\nIt's shame this town doesn't sit on river. I think Ma and Pa would like it here. And if it's going to be our base it would be ideal place for them to meet us. But Imme is little to far away for their liking, alas. Although, thinking about it, maybe it's best they did stay away. I wouldn't want them to be put into danger. If only Vujek was here, he has become like family to me.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Obeli/",
                                "fileName": "28-01-862-Hideout.md",
                                "date": {
                                    "formatedString": "28-01-862",
                                    "dayAsString": "28th",
                                    "day": "28",
                                    "month": "Obeli",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 28th of Obeli 862nd Year Age of Air, Hideout\n\nWe've been so busy last few days. Babcha seems to be desperate to finish watch tower and Nettle has been working on training room. I've asked her if she's prepared to teach me bit about using shields when it's finished and she said yes. Can't help but think shield would be useful if I'm going to end up fighting at close quarters. That sling is ok, but it's not same as my old crossbow, I can't fight in same way as I used to. It felt so much safer then, staying back at safe distance and picking off targets with crossbow, just can't do that with sling. Not to mention with my new powers I just feel like I have more options that make me more useful in melee than before, like that shadow I used at temple, that seemed to work well. But, if I am to fight at close range, having some more form of protection would help. I've been speaking about it with Mały in evenings and he did agree.\n\nIt's been so nice having opportunity to spend time with him. I've missed our family games of tongo. Krusk has proven keen to join us in our games as well, which has been nice. He reminds me of Vujek. I still remember playing 20 bones with two of them in Taramont and he even insisted we play game of it.\n\nI've been quite amazed at how much people have played actually. Durzol has joined in lot, but that's hardly surprising with how much he and Krusk do together, which is everything. Eary has wanted to play whenever she's seen me, but fortunately she's only been to hideout couple of times, spending most of her time working on some camp or something. Even Nettle played last night, and she was drinking quite liberally. I can't but wonder what was going on, I feel like there was something about her that was different, like it wass significant. I don't think it was anniversary of someone's death or something like that, that's not how you behave, or at least not how I would. I certainly drank on anniversary of Mały's death, but I wasn't close to jolly. I know Nettle is strange and very different to me, but surely this wasn't mourning. Anniversary of when she met someone, maybe. Wait, is Nettle married? Or birthday? What do humans celebrate? What would Nettle celebrate? That women intrigues me.\n\n"
                        }
                    ]
                },
                {
                    "month": "Hivali",
                    "entries": [
                        {
                            "header": {
                                "path": "./entries/862/Hivali/",
                                "fileName": "01-02-862-Hideout.md",
                                "date": {
                                    "formatedString": "01-02-862",
                                    "dayAsString": "01st",
                                    "day": "01",
                                    "month": "Hivali",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 1st of Hivali 862 Age of Air, Hideout\n\nAzshara is creepy. I don't know what it is about her, but there's something about her that's unnerving. When I was working on shrine I noticed it, she was just there and there was something about it that makes me uncomfortable. She's worse than Eary, she's just weird and way she talks to whatever it is, not herself, I saw it in council at Taramont. I don't know if it's ghost, part of Eary, some other Fey spirit thing or what. I just know Easry isn't talking to herself, but it's still weird and little unnerving hearing her talk like that. And she's creepy to, to be fair, but at leat she seems genuine and actually friendly. Even if she does call me undead abomination, I don't think she'd actually hurt me. but Azshara, she's just creepy, and so distant and aloof. She makes me uncomfortable.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Hivali/",
                                "fileName": "05-02-862-Hideout.md",
                                "date": {
                                    "formatedString": "05-02-862",
                                    "dayAsString": "05th",
                                    "day": "05",
                                    "month": "Hivali",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 5th of Hivali 862 Age of Air, Hideout\n\nWe spoke with Mały today and suggested he go scout Briar Pass and Waldern Heights. He agreed, Babcha seemed little worried he'd focus on powerful relics to much, as did Nettle, but I trust my Mały and I'm sure he'll do well. I just hope he stays safe, I'm sure he'll do good but Empire is powerful and scare me little. I don't know why Babcha doesn't trust him though. He's my brother and she's my Babcha, which makes her as good as family to me, which makes them family of sorts. How can you not trust your family? whatever, he's going and I'm sure he'll do well, maybe Babcha will trust him then.\n\nHe wanted to go straight away but I persuaded him to use day to prepare and leave on morrow, so we'd have one more night together. I'm glad I did and he stayed. This evening has been so much fun, we played tongo for so long. I tried to get Babcha to play but she wouldn't, but Durzol and Krusk joined us, as did Ailuin, I think she knows how much Mały means to me and values him, she knows he's part of this prophecy to.\n\nI really don't want Mały to go, we've grown close again. Losing him once was hard enough, I don't want to do it again. At least this time I'll have good memories of him.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Hivali/",
                                "fileName": "06-02-862-Hideout.md",
                                "date": {
                                    "formatedString": "06-02-862",
                                    "dayAsString": "06th",
                                    "day": "06",
                                    "month": "Hivali",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 6th of Hivali 862 Age of Air, Hideout\n\nI've been crying all day. Mały left this morning and saying goodbye was so painful, I pray I haven't lost him again. I'll never forgive myself. I've been praying for him all day. I'm so glad we've done this work on shine, it may not be finished but at least it gives me somewhere meaningful to pray.\n\nLlirra, keep my brother safe. Let me see him again. I can' loose him again.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Hivali/",
                                "fileName": "17-02-862-Hideout.md",
                                "date": {
                                    "formatedString": "17-02-862",
                                    "dayAsString": "17th",
                                    "day": "17",
                                    "month": "Hivali",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 17th of Hivali 862 Age of Air, Hideout\n\nHow have I not written in this for ten days? I'm still missing Mały, but I've stopped crying. Praise Llirra, she has given me strength. Now shine is finished it is good thing, I've spent so much time in there, building it during day and praying in evening. I feel Ailuin has noticed, she'sbeen very supportive since Mały left.\n\nNow I know why I haven't written for ten days. Each day is same and there's nothing to write. I get up, eat, work, eat, work, eat, pray and then, at end of day, we commune. That's only part of day that changes. Sometimes I don't feel like talking so I play brood or pray. Sometimes I'll play cards or dice with people, mainly Durzol and Krusk, although Ailuin has been joining in more since Mały left and seems to do so more when I'm feeling down. I like Ailuin. Of course, if Eary happens to show up when we play she'll join, and Urdlen plays as well, he seems quite good at tongo. Other times we'll talk, either as small groups or I'll talk to just one person. I prefer talking one to one.\n\nBut it's all been much same. Only thinf is, thinking about it, Nettle hasn't played since that one night. And she hasn't drank as much as she did then. What was significant about that day?\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Hivali/",
                                "fileName": "21-02-862-Hideout.md",
                                "date": {
                                    "formatedString": "21-02-862",
                                    "dayAsString": "21st",
                                    "day": "21",
                                    "month": "Hivali",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 21st of Hivali 862 Age of Air, Hideout\n\nI can't believe it, Urdlen is married to halfling. I can't believe he didn't tell me about Verzana before, she's striking. He showed me illusion of her.\n\nI'm amazed that he's never met her family though. We're typically very tightly knit with our families and it seems weird that she views him as her family. well, viewing him as part of her family, or as her family in sense Ma, Pa and Mały are my family. But as her entire family? Not wanting to introduce him to them or go see them for festivals? That seems odd to me. I mean, even uncle Corrin is family. I hope there's nothing wrong there. If somehow Urdlen is only family Verzna has she must be lonely right now. Yaga, I'd know, all those years by myself. I'll pray for her. At least Babcha is here for me, she may not even have that.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Hivali/",
                                "fileName": "28-02-862-Hideout.md",
                                "date": {
                                    "formatedString": "28-02-862",
                                    "dayAsString": "28th",
                                    "day": "28",
                                    "month": "Hivali",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 28th of Hivali 862 Age of Air, Hideout\n\nYaga, I hurt. I was right, Nettle had been going easy. Seems training proper has begun.\n\nUrdlen has spoken so much about his wife since he told me. Verzana sounds lovely and I'm sure it would be pleasure to meet her. He seems very. Ow, that hurt. Seems very devoted to her, he gets so emotional when he talks about her. Pish! My arm is killing me. Why Nettle? Why? What did I do to anger you and your Gods?\n\nIntereresting that he taught in Yita, that's where King is. I wonder how we can use his knowledge when we go check on King, may Llirra protect him. And I wonder if we could persuade any of his students to join cause. Yita, I haven't been to Emerald Depths in years. That will take me back. Shame it won't be on equinox.\n\n"
                        }
                    ]
                },
                {
                    "month": "Domak",
                    "entries": [
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "05-03-862-Hideout.md",
                                "date": {
                                    "formatedString": "05-03-862",
                                    "dayAsString": "05th",
                                    "day": "05",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 5th of Domak 862 Age of Air, Hideout\n\nI'm starting to get hang of using this shield, but I still think Nettle is trying to kill me. my arm doesn't hurt as much after training though, I've learnt to parry with thing rather than just block. That's why my arm hurt so much first few sessions. But she's still breaking my guard at times and I'm covered in bruises. Hopefully it will be worth it.\n\nBut, Yaga, I feel for Morthos. I didn't know what had happened to Golblin Cleavers. Thinking about it, it is strange how two of them are here but not others. How did I not notice that. I know not why Gimble saw fit to lead them to standing stones in drillwood, but for his folly to cost Vadania her life is travesty of justice. Just wait until I get my hands on that pem gnome, grokkel, I'll make him squirm, he'll pay. As Llirra is my witness, he'll pay for robbing someone of so much joy, and all to satisfy their own petty ego. I never liked that Gnome, now I know I was justified.\n\nI'm glad Babcha offered to help Morthos, he is pained soul, and while I know Babcha is kind at heart really, she can be little blunt. It would have been very easy of her to deal with that conversation without tact it needed. But, I am ready to help Morthos and so is Babcha. I'm sure we'll find Vadania and hopefully Morthos will find peace he needs, may Llirra find her way into his heart.\n\nI'm not sure I should be saying this, it feels crass, but if we do go to drilwood hopefully I'll have opportunity to find Eilnala. I still think it's worth talking to Shadow Thieves and seeing if they'll help against Empire.\n\nWhat have we got to lose? And Eilnala live in Drilwood, and works in drilwood. Hopefully I can find her.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "09-03-862-Hideout.md",
                                "date": {
                                    "formatedString": "09-03-862",
                                    "dayAsString": "09th",
                                    "day": "09",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 9th of Domak 862 Age of Air, Hideout\n\nTower is finely finished, I can't help but feel that it would have been done sooner if she hadn't spent so much time telling orcs what to do while they've been preparing defences. I mean, Nettle is one who was in military. She's done fine directing them and has then just let them do it. I don't know why Babcha has to interfere. Anyway, it's done. And defences are coming along well also. I have feeling that we will be leaving here soon. I don't know if that makes me sad or happy. This place has begun to feel like home and I have enjoyed being able to go see people nearby. It almost feels like I'm making family again. I hadn't realised how much I'd missed it. However, there is lot to do and many things weigh on my mind. I want to find Vujek, we need to make sure King is safe, we want to help Morthos, and of course there is small matter of Empire. Dark times. I fear I must venture out of this small piece of comfort I have found.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "11-03-862-Elderyard Road.md",
                                "date": {
                                    "formatedString": "11-03-862",
                                    "dayAsString": "11th",
                                    "day": "11",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Elderyard Road"
                            },
                            "data": "# 11th of Domak 862 Age of Air, Elderyard Road\n\nFinally, we're on road again. Had very long talk this morning about how to get to standing stones in drilwood. Isophie used her magic to get us to Drilwood in end. Only trouble is it means Gertrude will be by himself for day until she gets back. I hope he copes.\n\nWe didn't stay long in Drilwood, only to get some supplies before making our way down Elderyard Road to stones, so I didn't have time to look for Eilnala.\n\nIt felt strange bring back in Drilwwod after so long, I can't say I miss it.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "15-03-862-Standing Stones.md",
                                "date": {
                                    "formatedString": "15-03-862",
                                    "dayAsString": "15th",
                                    "day": "15",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Standing Stones"
                            },
                            "data": "# 15th of Domak 862 Age of Air, Standing Stones\n\nThis place is strange, there's something slightly unsettling about it. I'm glad Urdlen has made this tent. I hope it is worth it coming here.\n\nIt's strange this place indeed. It feels eerie but somehow also spiritual. It's making me think of Mały and Vujek. I hope they're ok. I'd rather be with them than here. But I want to help Morthos find his piece.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "16-03-862-drilwood.md",
                                "date": {
                                    "formatedString": "16-03-862",
                                    "dayAsString": "16th",
                                    "day": "16",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "drilwood"
                            },
                            "data": "# 16th of Domak 862 Age of Air, drilwood\n\nPlace we went to this morning was weird, even stranger than those stones. There were traps, some smoke filled room with burnt bodies in it. That led to another room full of bear traps, some of which turned out to be alive and attacked us. Babcha got attached by chest she'd kicked. Yaga, it was madness. It was just like when Vujek was with us.\n\nBut we got out of rooms eventually, and found this strange place with these ghostly images acting out scene, I think it weas from long ago, and then this strange animal came from no where and started talking to us, saying it was place. Everything was strange this morning, I don't like that place. I plan on giving those stones wide birth now.\n\nAfter following this thing around for some time we went to canteen and Eary looked at some books, I don't think anyone else noticed them, but she suddenly got jittery and seemed to want to go, she told me we were in danger. She wanted to use magic to get us out, but Urdlen wanted to stay for some stupid reason. Eventually we persuaded him to come and Eary magicked us away to Drilwood. I think everyone was fine about it, except Urdlen. He's been grumpy about it all day.\n\nBut this was my chance and Yaga I took it. Babcha and Morthos went to scry on Gimbol and may Llirra bring them fortune in their endeavours. I feel that gnome won't survive another encounter with us. Urdlen went of sulking and Nettle followed him. At last I had opportunity, only one left was Eary. I doubted she'd stop me, but of course she had to follow me, she couldn't just go and do something herself. Anyway, I went to find out if Eilnala was still in Drilwood and left message for her \\<) _ⴙ_ + þp. when I got there, I found note directing me to ٥Ʊ and I made off. Book had said Eilnala was leaving Drilwood soon so I knew time was short. Fate wasn't smiling on me though as everyone then arrived. Just to actually be able to get to meet I told them I was meeting someone and to follow.\n\nAt ٥Ʊ we met Eilnala and I made my case that guild should help us. She was little uncooperative, but I think we made deal. Now she's off to Taramont to try and make profit out of chaos there. I wish her luck.\n\nWe then went back to town to decide what to do. They haven't got any more decisive since Waldern Heights. Eventually we agreed to go make camp in woods outside town. Urdlen was still upset, as he is still now, and tried to use magic to make me look stupid. I wasn't having it and put on my hat of disguise and chose his wife, which really upset him. There's something about his wife he's not telling me that makes this sore subject for him, but what? Is she pregnant? Would explain why she's not with him, but I would have thought he'd stay with her if that was case. Curious. He has just got more interesting. I tried to apologise and move on, but he obviously wouldn't have it. He made his magic tent again tonight but wouldn't let me in it. Petty. He also wouldn't let Eary in because she took him away from place this morning. She kept dispelling his magic in response. It would have been funny if it wasn't so petty. What is going on here? Thinking about it, one who I'm closest to in my attitude is Nettle. Who'd have thought that? We're here training with shield and those two are behaving like children. Be nice if Vujek was here to knock some sense into them. at this rate Morthos will leave soon. I don't blame him his frustrations, although I don't appreciate comparison to Goblin Cleavers.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "17-03-862-drilwood.md",
                                "date": {
                                    "formatedString": "17-03-862",
                                    "dayAsString": "17th",
                                    "day": "17",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "drilwood"
                            },
                            "data": "# 17th of Domak 862nd Year Age of Air, drilwood\n\nLast night was wild, woke to Babcha shouting alarm. I could see her and Eary with man and women, and immediately got sinking feeling as Babcha attacked him, why dose she try and solve everything with violence? But this won't be hard, thought I, there's only two of them and six of us. How wrong was i? although I don't think it helped that I was only one doing anything. Urdlen just hid in his tent, Babcha ran away after being hit once, although I did rendezvous with her after and she looked rather bad, I even gave her healing potion, praise LLirra I kept one for myself though. Nettle just seemed to wonder around and Eary was just Eary. Only Morthos actually seemed to do anything.\n\nAt first I looked to sling at them before moving in but, alas, no opportunity presented itself. I did get to use magic on them when man had darkness round him. Yaga, that bolt did no good for them, it hit women as well. I thought it could do that, but I'd never seen it happen. Next chance I got I charged woman and struke her with my sword, Yaga it was good blow. But she escaped, she seemed to be wiry one she did.\n\nThen I couldn't move as man used magic on me and I was helpless as he then attacked me, and what good where my fellows? None. They just left me. I must have passed out because next thing I knew there was some lizard on me with flask and I had taste of potion in my mouth. I think there's more to that lizard than maybe would meet eye. It's spent time with Urdlen all day, so I think those two are connected, wizard is strange, he can do things I can't understand. But I had no time to ponder this back then, no. I just had time to make haste and withdraw, I even cast dark magic to make myself harder to hit.\n\nBut even now I refused to be useless. I still cast magic bolts at man to try and help bring him down. It was nice to finally see Eary do something as well as she punched man and sent him flying. Why couldn't she do before? Babcha was also wailing on him and she was in wolf form now. But what finally did it for them was Nettle, she was in form of what Urdlen and Babcha called tiranosorus, and she was end of them. they tried running and both me and Morthos cast magic to try and bring them down, but Nettle did for them. at least I think, there was darkness over there. I could see some things and could definitely hear fighting after we'd cast. But if I'm honest, I don't know who actually killed who. But they are dead now and can't hurt us, so what dose it matter.\n\nPraise LLirra for seeing me through this night. But I had shock when I did wake and saw giant monster. I had no idea what it wass or where it came from. And I didn't really notice Nettle was gone. I couldn't see her, but that could have just meant she'd plodded off somewhere. It was only after fight when Babcha and Urdlen explained it to me that I understood, and I'd seen tranosorrus turn back into Nettle.\n\nBut Yaga, what happened latter was not good. Empior troops came across camp. One staued to investigate while others moved on. Eary went up to him and I was so scared she'd do something stupid, but, praise LLirra, she didn't. to be fair she did really well. She got information out of him that we needed, and got him to not tell anyone about us. I think she used magic on him, same magic she's used on Quentis and Tou-Faon in guard room when we were getting my stuff back last time in Taramont. It's really useful and, praise Llirra, she had sense to use it and not do anything stupid.\n\nBut now empire has equipment from stones and we are another step behind. This is just going from worse to worse. I hate this.\n\nLlirra, I pray to you, give me sign. Let me know what to do, how can we stop what is happening? Llirra, I pray you give me strength I need in these dark days. I pray you will give us all strength we need and help guide us all through these dark times so we can once again bring your light upon world. I am yours, blessed be your name.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "17-03-862-Elderyard Road.md",
                                "date": {
                                    "formatedString": "17-03-862",
                                    "dayAsString": "17th",
                                    "day": "17",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Elderyard Road"
                            },
                            "data": "# 17th of Domak 862nd Year Age of Air, drilwood, Elderyard Road\n\nBabcha and Eary caught up with us before we'd gotten far, so I don'r know what all worry was about this morning. But after they had strange things happened, not least of which was that Nettle complimented me when we trained. Are rivers flowing uphill?\n\nI don't know what Babcha found this morning, but I think putting it in bag of holding was mistake. All of sudden things just started flying out of bag and eventually all that was left was normal bag, it was no longer magic and we could no longer fit all our gear in it. It was queer, I don't like what was happening, or that cube. it felt like it was sapping my magic. Everyone felt it. Well, everyone except Nettle. Morthos hid it in bush away from Urdlen's shelter and we divided all goods from bag between us to take back to hideout. I ended up carrying two suits of armour. I don't look forward to carrying them back to stones, they're heavy.\n\nAnd such shame this happened. We had done well, I thought. I had managed to do more training with my shield and I think I was getting better, I remembered that technique that Nettle had taught me where you hold out your shield to blind your opponent. I must have done well, or at least better than before, for Nettle complimented me on my work. All that even with Urdlen trying to interear. Maybe I'll get hang of this properly soon.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "18-03-862-standing Stones.md",
                                "date": {
                                    "formatedString": "18-03-862",
                                    "dayAsString": "18th",
                                    "day": "18",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "standing Stones"
                            },
                            "data": "# 18th of Domak 862nd Year Age of Air, standing Stones\n\nPish, those things were heavy. How right was I? part of me wishes we'd left damn things behind. If only Vujek was here, he's strong and would have been able to carry some of stuff to make it easier for those less able, like us halflings. I still miss Vujek, we must find him. I hope we start looking for him soon.\n\nIt also would have helped if I still had my bag of holding. I wonder where it is, I'll have to ask Babcha.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "19-03-862-Hideout.md",
                                "date": {
                                    "formatedString": "19-03-862",
                                    "dayAsString": "19th",
                                    "day": "19",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 19th of Domak 862nd Year Age of Air, Hideout\n\nSo much to think about, my head is spinning. Ok, Vujek, those grokkels have given up on him. Urdlen and his wife. How Ailuin saw someone who appears to be Urdlen's wife. Work Cancak has done with auromite. Bruno.\n\nAll right, so when we arrived back in village, praise LLirra that Eary could do that and save us walking all way back. That armour is too heavy for that. When we got back Ailuin saw us and cautioned us for fear someone might see, and that it was poignant as empire had been to village and refused to leave until major had bent knee and sworn loyalty. Tof. This is just getting worse and worse. Why here? But one of strangest things was one of people that was here with empire. When Ailuin tried to describe her I couldn't help but think of Urdlen's wife, and it seemed he had same thought as he cast image of Verzana and Ailuin was visibly taken aback. It seems that it was his wife with empire. But why? I spoke with him privately in evening, but he seemed convinced there must have been some mistake. He assured me that Verzana wouldn't side with grokkel, and I believe him. So either she has been coerced or something similar, or this wasn't Verzana and there is some mistake. Either way, I told him we'd help. Now I can only hope he accepts my apology for what I did in Drilwood. I didn't know that he'd lost her, or how he didn't know where she'd gone. Having lost Mały I can empathise with his pain and know 40 years would have done little to ease it.\n\nTof! I cannot believe everyone has given up on Vujek. Isn't he one of seven? How are we meant to fulfil prophecy without him? Pish that, isn't he our friend? Don't we at least owe it to him, as our friend, to at least try to find him? I care not what they say, I won't give up on him, and I'll do all in my power to find him and save him. Maybe Morthos can help, he can scry, hopefully he can shed light of Vujek's whereabouts. I'll have to ask him tomorrow.\n\nSo, Cancak. He showed us some of things he'd been working on, I have to admit I don't really understand it, but I'm only mere river folk. But from what I did understand it's very powerful and in hands of those who know how to use it, potentially dangerous. And as those hands are empire, it's more than potentially, it's actually. I also think he was saying how it exists in two forms, one seemed powerful and dangerous, other not so. But when combined it's devastating. Trouble is empire has access to it in former state, and has now found supply of it in later state. I fear worst.\n\nFinally, Bruno. It seems he has initiated himself into group and made hideout something of second home. I fear his eagerness to get involved will see harm comer to him. I don't know how to dissuade him without hurting him or threatening our relationship. I fear I may have too though. Llirra, please help me see another way.\n\n...\n\nI fear I have lost Bruno and I am so sad. Literally just after finishing writing I heard something and went to see what it was, Babcha and Nettle had also risen and it was clear something was wrong. When we got to where sound came from I could hear battle so called for everyone to wake and made to fight. What I saw was UIrdlen trying to hold off some monster. When we defeated it I heard Bruno. Urdlen had taught him magic which had drawn beast, and now I am to lose friend. My little human friend, he has been so kind to me, always welcoming, and now he's gone.\n\nAfter fight we went to see Loren and he told of how he had found Bruno and had vision at time. Urdlen had also had vision. Whatever, Loren set his mind that he and Bruno must run. And now I fear I won't see mały Bruno again.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "20-03-862-Hideout.md",
                                "date": {
                                    "formatedString": "20-03-862",
                                    "dayAsString": "20th",
                                    "day": "20",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Hideout"
                            },
                            "data": "# 20th of Domak 862nd Year Age of Air, Hideout\n\nVujek is alive! I was right to hope. Morthos used magic to see Vujek, he saw him in some workshop with sound of clanking in background, with desk with lenses and chemicals on it. There was another goliath there talking to some strange blue crystal, like we've seen with aromite crystals in empire machines. It seemed clear to Morthos that crystal was Uthal, as goliath called it his old friend and said it was \"your new body\". I fear this may be very bad, but at least Vujek is alive and there is chance we can save him.\n\nBut damn that stupid gnome. We would be in such better situation if he hadn't gone and shown he was here. They know he's with us. Damn him. Llirra curse him and his. No, not his family, they've done nothing. Apart from his wife, if it is his wife. She's with empire and Martzia claimed she has known her all her life. But that crazy women could well be lying, I have no reason to trust her.\n\nI guess I should start from beginning. Just after finishing my last entry I heard Durzol come into hide shouting about how he'd seen empire troops in town. Knowing Krusk was still out there I went out to look for him as soon as I'd heard Durzol say he didn't know where Krusk was. Not wanting to be seen I hugged undergrowth, skirting town, but couldn't find Krusk. But I did see Martzia and someone who looked like Verzana with five warforged in town. When I saw Verzana I felt this strange feeling, deep uncomfortableness. I remember what Ailuin had said about her, and she was right.\n\nI used sending stone to tell Babcha and Nettle what I'd seen and they said they thought I should come back. While it felt bad at time, leaving Krusk, but fortunately I happened to cross paths with him as I went back. Although I didn't need to see him with his member out, Yaga, I should be grateful he was just making water. Who knows what orcs do when they think they're alone.\n\nAnd praise Llirra I did find him, for empire troops where heading towards him, but I saw them and used magic to tell him. Praise Llirra he had sense to drop and hide, it would have been disaster if he'd frozen or gotten confused. Fortunately all was well and empire passed, leaving us to return to hide safely.\n\nWhen we were safely back at hide, what did we do? Why, talk. Of course. To be fair, I could see sense of it. This was delicate situation, we had promised not to bring war to this town. So we agreed to go in to observe and not engage, but Yaga did it take long time to decide if Urdlen should come. After what he did earlier tonight Babcha was very weary about letting him come. But in end, he joined us. I used my hat and Babcha used her own magic to disguise herself, while Ailuin used magic to make Nettle, Urdeln and Eary invisible. While I understand why there was issue about Urdlen, I don't understand why no one had issue with Eary coming, she is so unpredictable, but praise Llirra she did, she saved Hugh's life. That grokkel Martzia wanted Hugh to tell her about person they were looking for and when Hugh told her he didn't know what she was on about she went to kill him. Praise Llirra that Eary was there to save him.\n\nBut this is bad, from what Martzia said it is obvious to me who they are looking for. I pray they don't find him. Thanks be to Llirra that Isophie had means to let us communicate with Loren and warn him of this, hopefully he'll be able to throw them off his trail.\n\nI can't help but feel bad. I saw Martzia and Verzana before this and she asked where major was. Why did I answer? Why didn't I claim to not know? I didn't want to say anything for fear that she'd recognise my voice, and I again felt that cold chill around Verzana. But I could have shrugged, or used my magic. I pray that Llirra grants me wisdom to deal with such issues should it arise again.\n\nBut then that stupid gnome decided to throw stone in pond again. He stepped forward and shed his invisibility, as if using magic to say sorry would fix this. He challenged Verzana, asking where she'd gone and it didn't take long before it looked like we would be fighting in town we'd promised we wouldn't bring war to, and against five warforged. But fortunately he laked self respect needed to stand up for himself and started grovelling, which stayed Martzia's hand. But we were in no better situation for it, he still doesn't have his answers and we couldn't stop his wife getting what she wanted from Hugh with magic, so now they know person they seek is boy matching Bruno's description and which way he went, and empire knows Urdlen is here, and they know Urdlen is with us.\n\nI'm surprised Babcha didn't kill him when we got back to hide. I can't say I feel much sympathy for him after this night. And I don't feel compelled to help him with his wife anymore. It seems plain to me Verzana, regardless of what she is, is now enemy.\n\nBut now, after more talking, we have plan. I'm sure Babcha will be happy about it, but I think she will be only one, even though I supported idea. Yaga, why did I support this? Why are we doing this? We are going into fey wild. Desperate measures for desperate times indeed. Eary wants to go wherever it is she goes first and Babcha and Nettle want to go with her. I didn't like what she said, she came to hide and Fidget told us, it's strange to see it or him, or whatever, about how these dragons that empire has aren't actually dragons. They're something called soulbinders. I think that's what Eary is going on about.\n\nI am so tired now. After pem gnome did that pem thing with Bruno and then spending so long praying and then Durzol coming back in early hours of morning, leading to us going into town I haven't slept since we were at Standing Stones.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "21-03-862-Feywild Trane station.md",
                                "date": {
                                    "formatedString": "21-03-862",
                                    "dayAsString": "21st",
                                    "day": "21",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Feywild Trane station"
                            },
                            "data": "# 21st of Domak 862nd Year Age of Air, Feywild Trane station\n\nWe're waiting at something Babcha is calling Tane station, whatever that is. Well I know not what train is, I know I was right to be apprehensive about coming to feywild. This place is so bizarre, and I don't like it.\n\nAnd already things have gone wrong, Babcha was going to lead us back through portal to wherever she wanted to go, saying it was quickest way. But portal seemed to brake and then Kitsune appeared with some guards and we were led to cell. Horrible cell, it was open at back and sloped towards opening with water running out. It's almost like they want us to die. But soon we were taken to see river king, I can understand why they call him that, everything was full of water in that place.\n\nBut Babcha seemed to be able to convince him that rummers about her weren't true, but I have horrible feeling about these prophesies. One I've heard said she's one of Seven and we''l defeat Nocturne, apparently there's Fey prophecy that says she'll inadvertently destroy Feywild. I can't help but wonder if somehow it's by defeating Nocturne that she destroys Feywild. Who knows? I certainly don't.\n\nAs I said, Babcha managed to convince River king she wasn't threat and he let us go, in spite of Eary's efforts to get us killed. Trying to cast magic on that tree, I'm glad I stopped her there, and following river king around moking him. Stupid thing. But we were allowed to go, but river king told us he wanted Kitsune to go with us as our guide, and to make sure we don't do wrong. Clearly he doesn't trust us completely.\n\nAnd now we're at this station waiting for it to rain, because that's when train runs or something. What is train? Some kind of boat? How dose it raining mean it can go? I don't understand this place, and won't be sad when I leave.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "21-03-862-Feywild trane.md",
                                "date": {
                                    "formatedString": "21-03-862",
                                    "dayAsString": "21st",
                                    "day": "21",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Feywild trane"
                            },
                            "data": "# 21st of Domak 862nd Year Age of Air, Feywild trane\n\nWell, now I've seen train, and I still don't know what it is. Some strange hulking mass of metal on wheels, that rides on rainbow. What sort of crazy place is this? And what ride on trane it was. River king warned us that there would be people who meant Babcha harm, and certainly little shits we were accosted by did. Murderous little crazies. First we knew trane suddenly came to complete halt and we set off to find what was wrong. My fellows failed to keep up with me and I was attacked by whole hord of what Babcha called red caps, crazy is what I call them. but we won day soon enough, though I was hurting by end. Damn things. Damn place. Praise be to Llirra that my fellows have magic to heal.\n\nAfter we'd seen off little manics we went to front of tain to see what was wrong and there was two more of them. but we took them into captivity with little triouble and I bound them. when we got to front of trane one of them was singing, which was strange and seemed very out of character for them. but as soon as we stopped him trane started again. If it hadn't been such serious situation watching Babchago flying would have been funny. I still don't understand this trane, or this place. It's weird\n\nThen we took redcaps back to where we'd been at start, Babcha's farther was still there, still drinking. It was interesting seeing those two, I don't typically think of Babcha as family orientated, but here she was with her farther looking like daughter for first time. It was nice. But I don't like what he said about this final party, hopefully it was just fey hyperbole. You know what they're like.\n\nBut those red cap prisoners were no use. No matter what Babcha tried they wouldn't tell us anything. Now one is tied up in bag in corner and other is smear on wall. Eary is scary. She seems to have no inhibitions in this place. I can't imagine her using her ring to hurt someone like that in real world, or really hurting anyone at all. Maybe she is another reason to get out of this place as soon as possible. I hope Babcha gets what she came here for soon.\n\n"
                        },
                        {
                            "header": {
                                "path": "./entries/862/Domak/",
                                "fileName": "21-03-862-Feywild somewhere.md",
                                "date": {
                                    "formatedString": "21-03-862",
                                    "dayAsString": "21st",
                                    "day": "21",
                                    "month": "Domak",
                                    "yearAsString": "862nd year, Age of Air",
                                    "year": "862"
                                },
                                "location": "Feywild somewhere"
                            },
                            "data": "# 21st of Domak 862nd Year Age of Air, Feywild somewhere\n\nYaga, I thought trane was bad. Where we have just come from is so much worse. We left Queen and Babcha 's mother, tof, I do not like her, and set out to find inn. We'd all agreed that's where we wanted to go and, apparently that's how you find places in that city, just thinking of them, madness, we set off. But rather than finding ourselves in inn where we could rest our weary heads we find ourselves here. In this mass of grass so tall I doubt Vujek could see over it and somewhere out there is some pem Fey creature that wants my eyes. Damn this place. I hope Babcha can deal with it, being Fey.\n\nBut that city was wired, like everything here. We went in to try and find queen. You'd think we could just walk to wherever her palace, or whatever, is, but no. we needed to think of it and then somehow we'd magically stumble along it, as if thinking thinking of end of your path would change destination. Going down Reed Road would take me to Yita, no matter how much I wished it to take me to Drilwood, or even Taramont. And how was I to think of place I'd never been anyway? Whatever, we found our way there eventually. And, Yaga, was there lot of talking when we did. Not sure I like how Babcha was judged, but nothing has happened as result. Don't know what Nettle was thinking stepping forward to get judged as well. 'twas folly if you ask me.\n\nJust like making deal with devil. Or whatever that one armed thing was that we met after leaving train. I know not exactly of what it spoke about to Babcha but I fear this deal itreferenced may come back to haunt us. But why is everyone wanting to give Babcha task? First River King, now this devil creature and queen. At this rate we'll be doing something for every damn Fey in this damn place.\n\n"
                        }
                    ]
                }
            ]
        }
    ]
}